{
  "_name_or_path": "classla/multilingual-IPTC-news-topic-classifier",
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "education",
    "1": "human interest",
    "2": "society",
    "3": "sport",
    "4": "crime, law and justice",
    "5": "disaster, accident and emergency incident",
    "6": "arts, culture, entertainment and media",
    "7": "politics",
    "8": "economy, business and finance",
    "9": "lifestyle and leisure",
    "10": "science and technology",
    "11": "health",
    "12": "labour",
    "13": "religion",
    "14": "weather",
    "15": "environment",
    "16": "conflict, war and peace"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "arts, culture, entertainment and media": 6,
    "conflict, war and peace": 16,
    "crime, law and justice": 4,
    "disaster, accident and emergency incident": 5,
    "economy, business and finance": 8,
    "education": 0,
    "environment": 15,
    "health": 11,
    "human interest": 1,
    "labour": 12,
    "lifestyle and leisure": 9,
    "politics": 7,
    "religion": 13,
    "science and technology": 10,
    "society": 2,
    "sport": 3,
    "weather": 14
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.45.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
